### Slide_45

"""
Напишіть скрипт, який обчислює 
площу прямокутника a*b, 
площу трикутника 0.5*h*a, 
площу кола pi*r**2 
і цей скрипт використати в іншому модулі, в якому ми запитуємо користувача площу якої фігури він хоче обчислити. 

модуль1, який містить три функції для знаходження площ, 
модуль2, в якому імпортований модуль1 і виконується основна логіка програми.
"""

import math

def sqRectangle(a: int, b: int) -> int:
    """
    Функція розраховує площу прямокутника,
    якщо відома його довжина та ширина.
    """
    return a * b

def sqCircle(r: int) -> int:
    """
    Функція розраховує площу кола, якщо відомо радіус (r).
    """
    return math.pi * math.pow(r, 2)

def sqTriangle(a: int, b: int) -> int:
    """
    Функція розраховує площу прямокутного трикутника за формулою Герона,
    якщо відома довжина двох катетів (a,b) цього трикутника.
    """
    return 0.5 * a * b


if __name__ == "__main__":
    print(sqRectangle(5,6))     # 30
    print(sqCircle(3))          # 28.274333882308138
    print(sqTriangle(5,6))      # 15.0



